app/Controllers/Producto_controller.php

SELECT *
FROM `generos`
SELECT *
FROM `categorias`
SELECT *
FROM `marcas`
SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'
 LIMIT 6, 3
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `eliminado` = 'NO'
---
    public function catalogo()
    {
        $productoModel = new \App\Models\Producto_model();
        $generoModel = new \App\Models\Genero_model();
        $edadModel = new \App\Models\Edad_model();
        $categoriaModel = new \App\Models\Categoria_model();
        $marcaModel = new \App\Models\Marca_model();

        $filtros = [
            'genero' => $generoModel->findAll(),
            'edad' => $edadModel->findAll(),
            'categoria' => $categoriaModel->findAll(),
            'marca' => $marcaModel->findAll(),
        ];

        $productos = $productoModel->where('eliminado', 'NO');

        // filtros opcionales
        $generoId = $this->request->getGet('genero');
        $edadId = $this->request->getGet('edad');
        $categoriaId = $this->request->getGet('categoria');
        $marcaId = $this->request->getGet('marca');

        if ($generoId) $productos->where('genero_id', $generoId);
        if ($edadId) $productos->where('edad_id', $edadId);
        if ($categoriaId) $productos->where('categoria_id', $categoriaId);
        if ($marcaId) $productos->where('marca_id', $marcaId);

        // paginación
        $data['productos'] = $productos->paginate(3); //6 productos por página